gauthig/firefly-touch/proxy/sdkconfig.defaults
# Classic ESP32 (ESP32-D0WD-V3, 4 MB flash, no PSRAM) — the basement BLE
# proxy. Deliberately NOT the panels' ESP32-S3 config: no PSRAM, no RGB LCD,
# no TWAI, and BLE 4.2 rather than 5.0.
CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Custom single-factory table: the IDF default gives the app 1 MB and a
# Bluedroid + WiFi build is just over that. See proxy/partitions.csv.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# Bluetooth: BLE only. Releasing the Classic BT controller memory is worth
# real RAM on this chip, which (unlike the S3) has a full BR/EDR radio.
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BTDM_CTRL_MODE_BLE_ONLY=y
CONFIG_BTDM_CTRL_MODE_BR_EDR_ONLY=n
CONFIG_BTDM_CTRL_MODE_BTDM=n

# GATT client only — this node never advertises or acts as a peripheral.
CONFIG_BT_GATTC_ENABLE=y
CONFIG_BT_GATTS_ENABLE=n

# One BLE link today (the Power Watchdog). Headroom for the three battery
# packs if the batteries are ever consolidated onto this node — raising it
# later means re-flashing, and the RAM cost is small.
CONFIG_BT_ACL_CONNECTIONS=5

CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_COMPILER_OPTIMIZATION_PERF=y
